Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/duties_and_vat/excise_duties.html.txt.tmx
Source language: en
Languages: ga

source: Certain goods are subject to excise duty, such as alcoholic beverages, tobacco products and mineral oils (for example petrol, diesel and kerosene)
ga: Tá roinnt earraí faoi réir dleacht mháil, ar nós deochanna meisciúla, táirgí tobac agus olaí mianracha (mar shampla, peitreal, díosal agus ceirisín)

source: In Budget 2017 the excise duty on a packet of 20 cigarettes was increased by 50 cent (including VAT) with a pro-rata increase on other tobacco products, with effect from midnight on 11 October 2016
ga: I mBuiséad 2017 méadaíodh an dleacht mháil ar pháicéad 20 toitín faoi 50c cent (lena n-áirítear CBL) agus tháinig méadú pro-rata ar tháirgí eile tobac, ó mheánoíche ar11 Deireadh Fómhair 2016

source: In Budget 2016 the excise duty on a packet of 20 cigarettes was increased by 50 cent (including VAT) with a pro-rata increase on other tobacco products, with effect from midnight on 13 October 2015
ga: I mBuiséad 2016 méadaíodh an dleacht mháil ar pháicéad 20 toitín faoi 50c cent (lena n-áirítear CBL) agus tháinig méadú pro-rata ar tháirgí eile tobac, ó mheánoíche ar13 Deireadh Fómhair 2015

source: In Budget 2015 the excise duty on a packet of 20 cigarettes was increased by 40 cent (including VAT) with a pro-rata increase on the other tobacco products, with effect from midnight on 14 October 2014.The excise duty on roll-your-own tobacco was increased by an additional 20 cent (including VAT) per 25g pouch with effect from midnight on 14 October 2014
ga: I mBuiséad 2015 méadaíodh an dleacht mháil ar pháicéad 20 toitín faoi 40c cent (lena n-áirítear CBL) agus tháinig méadú pro-rata ar tháirgí eile tobac, ó mheánoíche ar14 Deireadh Fómhair 2014. Méadaíodh an dleacht máil ar thobac rollta 20 cent sa bhreis (CBL san áireamh) in aghaidh an mháilín 25g le héifeacht ó mheán oíche an 14 Deireadh Fómhair 2014

source: In Budget 2014 the excise duty on a packet of 20 cigarettes was increased by 10 cent (including VAT) with a pro-rata increase on the other tobacco products, with effect from midnight on 15 October 2013
ga: I mBuiséad 2014 méadaíodh an dleacht mháil ar pháicéad 20 toitín faoi 10c cent (lena n-áirítear CBL) agus tháinig méadú pro-rata ar tháirgí eile tobac, ó mheánoíche ar 15 Deireadh Fómhair 2013

source: The excise duty on a pint of beer or cider, and on a standard measure of spirits was increased by 10 cent (including VAT) and the duty on a 75cl bottle of wine was increased by 50 cent (including VAT), with effect from midnight on 15 October 2013
ga: Tháinig méadú 10 cent (CBL san áireamh) ar an dleacht máil ar phionta beorach nó ceirtlise, agus ar mhiosúr caighdeánach biotáillí agus tháinig méadú 50 cent (CBL san áireamh) ar bhuidéal fíona 75cl, le héifeacht ó mheán oíche an 15 Deireadh Fómhair 2013

source: In Budget 2013 the excise duty on a pint of beer or cider and on a standard measure of spirits was increased by 10c (including VAT) and the duty on a 75cl bottle of wine was increased by €1 (including VAT), with pro-rata increases on other products
ga: I mBuiséad 2013 tháinig méadú 10 cent (CBL san áireamh) ar an dleacht máil ar phionta beorach nó ceirtlise agus ar mhiosúr caighdeánach biotáillí agus tháinig méadú €1 (CBL san áireamh) ar bhuidéal fíona 10c, agus tháinig méaduithe pro-rata ar tháirgí eile

source: These increases took effect from midnight on 5 December 2012
ga: Tugadh éifeacht do na méaduithe seo ó mheán oíche, an 5 Nollaig 2012

source: The excise duty on a packet of 20 cigarettes was increased by 10c (including VAT) with a pro-rata increase on the other tobacco products, with effect from midnight on 5 December 2012
ga: Méadaíodh an dleacht mháil ar pháicéad 20 toitín faoi 10c cent (lena n-áirítear CBL) agus tháinig méadú pro-rata ar tháirgí eile tobac, ó mheánoíche ar 5 Nollaig 2012

source: The excise duty on roll-your-own tobacco was also increased by 50c per 25g pouch with effect from midnight on 5 December 2012
ga: Méadaíodh an dleacht máil, chomh maith, ar thobac rollta 50c in aghaidh an mháilín 25g le héifeacht ó mheán oíche, an 5 Nollaig 2012

source: A relief from excise duty on auto-diesel for licensed road hauliers will be introduced from 1 July 2013
ga: Tabharfar faoiseamh ó dhleacht máil ar dhíosal d’fheithiclí bóthair i measc tarlóirí ceadúnaithe bóthair isteach ón 1 Iúil 2013 ar aghaidh

source: Under State Aid rules, Ireland must inform the EU Commission
ga: Faoi rialacha Státchabhrach, caithfidh Éire Coimisiún an AE a chur ar an eolas

source: In Budget 2012 excise duty on a packet of 20 cigarettes was increased by 25 cent (including VAT) with a pro-rata increase on other tobacco products
ga: I mBuiséad 2012 méadaíodh an dleacht mháil ar pháicéad 20 toitín faoi 25c (lena n-áirítear CBL) agus tháinig méadú pro-rata ar tháirgí eile tobac

source: You can learn more about excise duties on the Revenue website
ga: Is féidir tuilleadh a léamh faoi dhleachtanna máil ar láithreán gréasáin na gCoimisinéirí Ioncaim
